spcalendarpro.min.js

/*
* @name SPCalendarPro
* Version 2018.02
* No dependencies!
* @description An ultra lightweight JavaScript library to easily manage SharePoint calendar events.
* @category Plugins/SPCalendarPro
* @author Sam Perrow sam.perrow399@gmail.com
*
* Copyright 2018  Sam Perrow  (email : sam.perrow399@gmail.com)
* Licensed under the MIT license:
* http://www.opensource.org/licenses/mit-license.php
*/

!function(e,t){e.spcalpro=function(){function e(e,t){return{beginDateTime:e,beginDate:new Date(e.toDateString()),beginTime:e.toTimeString(),endDateTime:t,endDate:new Date(t.toDateString()),endTime:t.toTimeString()}}n.prototype.isSameDate=function(){var e=this.userDateTimes.beginDate,t=this.userDateTimes.endDate;return this.listData=this.listData.filter(function(r){return r.EventDate.toDateString()===e&&r.EndDate.toDateString()===t}),this},n.prototype.matchDateTimes=function(){var e=this.userDateTimes.beginDateTime,t=this.userDateTimes.endDateTime;return this.listData=this.listData.filter(function(r){return r.EventDate<=e&&r.EndDate>=t}),this},n.prototype.isTimeConflict=function(){var e=this.userDateTimes.beginDateTime,t=this.userDateTimes.endDateTime;return this.listData?this.listData=this.listData.filter(function(r){var n=r.EventDate,a=r.EndDate;return e<=n&&t>=a||n<e&&a>e||n<t&&a>t||e<n&&t>a}):console.log("no data"),this},n.prototype.where=function(e){var t=e.split(" ")[0],r=e.split(" ")[1],n=e.split(" ")[2],a={"=":function(e,t){return e==t},">":function(e,t){return e>new Number(t)},"<":function(e,t){return e<new Number(t)},">=":function(e,t){return e>=new Number(t)},"<=":function(e,t){return e<=new Number(t)},"!=":function(e,t){return e!=t}};return this.listData=this.listData.filter(function(e){return a[r](e[t],n)}),this},n.prototype.getDateTimesFromForm=function(t,n){var a=r(t,n);return this.userDateTimes=e(a.userBeginDT,a.userEndDT),this},n.prototype.getEventsAfterToday=function(){return this.listData=this.listData.filter(function(e){var t=new Date;return e.EventDate>=t||e.EndDate>=t}),this},n.prototype.provideDateTimes=function(t,r){return this.userDateTimes=e(t,r),this};var t=function(e,t,r){var n,a,i=void 0===t.async||t.async,s="<soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'><soap:Body><GetListItems xmlns='http://schemas.microsoft.com/sharepoint/soap/'><listName>"+t.listName+"</listName>",o="<DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap>",u="</Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions></GetListItems>",l="",c=t.fields?function(){for(var e="",r=0;r<t.fields.length;r++)e+="<FieldRef Name='"+t.fields[r]+"'/>";return e}():"";function m(e){if(4==e.readyState&&200==e.status){if(t.listData=function(e){for(var n=[],a=0;a<e.length;a++){var i={},s=e[a].attributes;if("z:row"===e[a].nodeName){for(var o=0;o<s.length;o++){var u=s[o].name.split("ows_")[1];i[u]="EventDate"===u||"EndDate"===u?new Date(s[o].value.replace("-","/")):s[o].value}"calendar"===r&&t.getEventsAfterDate?i.EventDate>=t.getEventsAfterDate&&n.push(i):n.push(i)}}return n}(e.responseXML.querySelectorAll("*")),t.callback)return t.callback(t)}else if(500==e.status)return t.error={errorCode:e.responseText.split('<errorcode xmlns="http://schemas.microsoft.com/sharepoint/soap/">')[1].split("</errorcode>")[0],errorString:e.responseText.split('<errorstring xmlns="http://schemas.microsoft.com/sharepoint/soap/">')[1].split("</errorstring>")[0],faultString:e.responseText.split("<faultstring>")[1].split("</faultstring>")[0]}}return"calendar"===r?l="single"===t.type?"<query><Query><Where><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>0</Value></Eq></Where></Query></query></GetListItems>":"recurring"===t.type?"<query><Query><Where><And><DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>1</Value></Eq></And></Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions></GetListItems>":"<query><Query><Where>"+o+u:"list"===r&&(l="<viewFields><ViewFields>"+c+"</ViewFields></viewFields></GetListItems>"),n=s+l+"</soap:Body></soap:Envelope>",(a=new XMLHttpRequest).open("POST",e.SPInfo.soapURL,i),a.setRequestHeader("X-Requested-With","XMLHttpRequest"),a.setRequestHeader("Content-Type",'text/xml;charset="utf-8"'),a.send(n),!0===i?a.onload=function(){return m(a)}:m(a),t.listData};String.prototype.formatInputToHours=function(){var e=this.split(" "),t=Number(e[0]);return"PM"===e[1]&&t<12?t+=12:t};var r=function(e,t){function r(e){var t=document.querySelectorAll('input[id$="DateTimeField_DateTimeFieldDate"]')[e].parentNode.parentNode,r=t.getElementsByClassName("ms-dttimeinput")[0];if(r)var n=r.getElementsByTagName("select")[0].value,a=r.getElementsByTagName("select")[1].value;return{date:t.getElementsByTagName("td")[0].getElementsByTagName("input")[0].value,time:function(){return n&&a?n.formatInputToHours()+":"+a:""}}}e=e||0,t=t||1;var n=r(e),a=r(t);return{userBeginDT:new Date(n.date+" "+n.time()),userEndDT:new Date(a.date+" "+a.time())}};function n(e,r){var n,a;return this.listName=e.listName,this.userDateTimes={},this.SPInfo=(n=e,{year:15===(a=_spPageContextInfo.webUIVersion)?"2013":"2010",soapURL:n.sourceSite?n.sourceSite+"/_vti_bin/Lists.asmx":15===a?_spPageContextInfo.webAbsoluteUrl+"/_vti_bin/Lists.asmx":document.location.protocol+"//"+document.location.host+_spPageContextInfo.webServerRelativeUrl+"/_vti_bin/Lists.asmx"}),this.getEventsAfterDate=!!e.getEventsAfterDate&&e.getEventsAfterDate,this.fields=e.fields?e.fields:null,e.callback&&(this.callback=function(){return e.callback(this)}),this.listData=t(this,e,r),this}return{getCalendarEvents:function(e){return new n(e,"calendar")},getListItems:function(e){return new n(e,"list")},getDateTimesFromForm:function(t,n){var a=r(t,n);return e(a.userBeginDT,a.userEndDT)},disableDragAndDrop:function(){ExecuteOrDelayUntilScriptLoaded(function(){var e=SP.UI.ApplicationPages.CalendarContainerFactory.create;SP.UI.ApplicationPages.CalendarContainerFactory.create=function(t,r,n,a,i){if(r.dataSources&&r.dataSources instanceof Array&&r.dataSources.length>0)for(var s=0;s<r.dataSources.length;s++)r.dataSources[s].disableDrag=!0;e(t,r,n,a,i)}},"SP.UI.ApplicationPages.Calendar.js")}}}()}(this);
